	//接口
	/**
	 * ====================================================================================================
	 * 方法名称: ${tablecomment}--列表<br>
	 * 方法创建日期: ${time}<br>
	 * 方法创建人员: ${author}<br>
	 * 方法维护信息: 写明时间，维护人员，维护内容<br>
	 * 方法功能描述: ${tablecomment}--列表<br>
	 * 方法: ●原创○沿用○重构汇
	 * ====================================================================================================
	 */
	List<Map<String,Object>> get${entity}List(JSONObject pageData);
	
	//实现类
	/**
	 * ====================================================================================================
	 * 方法名称: ${tablecomment}--列表<br>
	 * 方法创建日期: ${time}<br>
	 * 方法创建人员: ${author}<br>
	 * 方法维护信息: 写明时间，维护人员，维护内容<br>
	 * 方法功能描述: ${tablecomment}--列表<br>
	 * 方法: ●原创○沿用○重构汇
	 * ====================================================================================================
	 */
	@Override
	public List<Map<String,Object>> get${entity}List(JSONObject pageData) {
	
	    List<Map<String,Object>> ${tablename}List = dao.get${entity}List(pageData);;
	    return ${tablename}List;
	}
	